#ifndef __ball__
#define __ball__

//------------------------------------------------------------------------------
// ball.h - содержит описание шара
//------------------------------------------------------------------------------

#include <fstream>

using namespace std;

# include "rnd.h"
#include "shape.h"

//------------------------------------------------------------------------------
// шар
struct ball : shape {
    int r; // стороны
};

// Ввод параметров шара из файла
void In(ball &b, ifstream &ifst);

// Случайный ввод параметров шара
void InRnd(ball &b);

// Вывод параметров шара в форматируемый поток
void Out(ball &b, ofstream &ofst);

// Вычисление обёма шара
double Volume(ball &b);

#endif //__ball__
