//------------------------------------------------------------------------------
// tetrahedron.cpp - содержит функции обработки тетраэдра
//------------------------------------------------------------------------------

#include "tetrahedron.h"
#include <cmath>
#include <iostream>

//------------------------------------------------------------------------------
// Ввод параметров тетраэдра из потока
void In(tetrahedron &t, ifstream &ifst) {
    ifst >> t.a;
}

// Случайный ввод параметров тетраэдра
void InRnd(tetrahedron &t) {
    t.a = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров тетраэдра в поток
void Out(tetrahedron &t, ofstream &ofst) {
    ofst << "It is Tetrahedron: a = "
         << t.a << ". Volume = " << Volume(t) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление объёма тетраэдра
double Volume(tetrahedron &t) {
    return double(t.a * t.a * t.a * sqrt(2) / 12);
}
